## Нумерация

**Ограничение времени:** 1 секунда

**Ограничение памяти:** 64Mb

**Ввод:** стандартный ввод или `input.txt`

**Вывод:** стандартный вывод или `output.txt`

Напишите функцию `numbering()` для нумерации комнат.

На занятии мы написали функцию `greet()`:

```python
def greet(): 
    name = input() 
    print("Hello,", name)
```

Исправьте эту функцию так, чтобы она спрашивала у пользователя номер комнаты, а затем выводила строку в форме ”Комната № {число}”.

В решении вы должны только написать эту функцию, но не запускать её. Чтобы тестирующая система могла проверить её, функция должна быть названа в точности `numbering` и не должна иметь аргументов.

**Формат ввода**

`numbering()`

С клавиатуры вводится:

```
8
```

**Формат вывода**

```
Комната № 8
```

**Пример**

| Ввод | Вывод       |
|------|-------------|
| 8    | Комната № 8 |

**Примечания**

Эта и последующие похожие задачи проверяются следующим образом:
1. В тестирующую систему вы должны отправить файл с только необходимой функцией. Если в файле есть код вызова данной функции, то закомментируйте его.
2. При проверке вашей функции тестирующая система запускает программу на Python, которая осуществляет вызов вашей функции (с передачей в неё параметров).
3. Вам необходимо точно соблюсти формат сигнатуры функции, который дается в условии.