s = {}
for _ in range(5):
    a = input().split(": ")
    s[a[0]] = int(a[1])
r = int(input())
recipes = {
    "Сладкоежка": ["банан", "молоко", "мороженое"],
    "Клубнично-банановый": ["клубника", "молоко", "банан", "мороженое"],
    "Клубничный": ["клубника", "молоко", "мороженое"],
    "Хушаф": ["финики", "молоко"],
    "Банановый": ["банан", "молоко", "финики"]
}
for _ in range(r):
    o = input()
    can = True
    for i in recipes[o]:
        if s.get(i, 0) < 1:
            can = False
            break
    if can:
        print("Пожалуйста, ваш " + o + ". Приятного аппетита!")
        for i in recipes[o]:
            s[i] -= 1
    else:
        print("Извините, не можем выполнить заказ.")
